dennisppaul/klangstrom-arduino/stm32/variants/KLST_CORE/variant_KLST_CORE.h
/* -------------------------------------------------------------------------- */
/* --- KLST ----------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

#define D_CACHE_DISABLED

#define HAL_MODULE_ENABLED

#ifndef HAL_I2S_MODULE_ENABLED
#define HAL_I2S_MODULE_ENABLED
#endif
#ifndef HAL_SPI_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
#endif
#ifndef HAL_TIM_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#endif
#ifndef HAL_PCD_MODULE_ENABLED
#define HAL_PCD_MODULE_ENABLED
#endif
#ifndef HAL_HCD_MODULE_ENABLED
#define HAL_HCD_MODULE_ENABLED
#endif
#ifndef HAL_GPIO_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#endif
#ifndef HAL_DMA_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#endif
#ifndef HAL_MDMA_MODULE_ENABLED
#define HAL_MDMA_MODULE_ENABLED
#endif
#ifndef HAL_RCC_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#endif
#ifndef HAL_FLASH_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#endif
#ifndef HAL_EXTI_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#endif
#ifndef HAL_PWR_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#endif
#ifndef HAL_I2C_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#endif
#ifndef HAL_CORTEX_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#endif
#ifndef HAL_HSEM_MODULE_ENABLED
#define HAL_HSEM_MODULE_ENABLED
#endif

#define HSE_VALUE               (16000000)
#define HSE_STARTUP_TIMEOUT     (100UL)
#define CSI_VALUE               (4000000UL)
#define HSI_VALUE               (64000000UL)
#define LSE_VALUE               (32768UL)
#define LSE_STARTUP_TIMEOUT     (5000UL)
#define LSI_VALUE               (32000UL)
#define EXTERNAL_CLOCK_VALUE    (12288000UL)

#undef USBD_VBUS_DETECTION_ENABLE

/* -------------------------------------------------------------------------- */

// // On-board LED pin number
// #ifndef LED_BUILTIN
//   #define LED_BUILTIN           PNUM_NOT_DEFINED
// #endif

// // On-board user button
// #ifndef USER_BTN
//   #define USER_BTN              PNUM_NOT_DEFINED
// #endif

// // SPI definitions
// #ifndef PIN_SPI_SS
//   #define PIN_SPI_SS            PA4
// #endif
// #ifndef PIN_SPI_SS1
//   #define PIN_SPI_SS1           PA15
// #endif
// #ifndef PIN_SPI_SS2
//   #define PIN_SPI_SS2           PG10
// #endif
// #ifndef PIN_SPI_SS3
//   #define PIN_SPI_SS3           PNUM_NOT_DEFINED
// #endif
// #ifndef PIN_SPI_MOSI
//   #define PIN_SPI_MOSI          PA7
// #endif
// #ifndef PIN_SPI_MISO
//   #define PIN_SPI_MISO          PA6
// #endif
// #ifndef PIN_SPI_SCK
//   #define PIN_SPI_SCK           PA5
// #endif

// // I2C definitions
// #ifndef PIN_WIRE_SDA
//   #define PIN_WIRE_SDA          PB7
// #endif
// #ifndef PIN_WIRE_SCL
//   #define PIN_WIRE_SCL          PB6
// #endif

// // Timer Definitions
// // Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
// #ifndef TIMER_TONE
//   #define TIMER_TONE            TIM6
// #endif
// #ifndef TIMER_SERVO
//   #define TIMER_SERVO           TIM7
// #endif

// // UART Definitions
// #ifndef SERIAL_UART_INSTANCE
//   #define SERIAL_UART_INSTANCE  4
// #endif

// // Default pin used for generic 'Serial' instance
// // Mandatory for Firmata
// #ifndef PIN_SERIAL_RX
//   #define PIN_SERIAL_RX         PA1
// #endif
// #ifndef PIN_SERIAL_TX
//   #define PIN_SERIAL_TX         PA0
// #endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
// #if !defined(HAL_ETH_MODULE_DISABLED)
//   #define HAL_ETH_MODULE_ENABLED
// #endif
// #if !defined(HAL_QSPI_MODULE_DISABLED)
//   #define HAL_QSPI_MODULE_ENABLED
// #endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif

#ifdef __cplusplus
} // extern "C"
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR   Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE  Serial
  #endif
#endif

/* -------------------------------------------------------------------------- */
/* --- KLST ----------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

/* --------------- */
#ifdef __cplusplus
extern "C" {
#endif
/* --------------- */

/* GPIO */

#define GPIO_00	PE7
#define GPIO_01	PE3
#define GPIO_02	PE0
#define GPIO_03	PC13
#define GPIO_04	PF2
#define GPIO_05	PF3
#define GPIO_06	PF4
#define GPIO_07	PF10
#define GPIO_08	PC0
#define GPIO_09	PC1
#define GPIO_10	PC4
#define GPIO_11	PC5
#define GPIO_12	PB0
#define GPIO_13	PB1
#define GPIO_14	PG0
#define GPIO_15	PG1

/* BUTTON */

#define BUTTON_PROGRAMMER	PG2
#define BUTTON_USER_00	  PD15
#define BUTTON_USER_01	  PD14

/* LED */

#define LED_00	PG5
#define LED_01	PG3
#define LED_02	PG4

/* ADC+DAC */

#define ADC_00	PF5
#define ADC_01	PF11
#define ADC_02	PF13
#define ADC_03	PF6
#define ADC_04	PF12
#define ADC_05	PF14

#define DAC_00	PA5
#define DAC_01	PA4

/* USART */

#define UART_00_RX	PG9
#define UART_00_TX	PG14
#define UART_01_RX	PA10
#define UART_01_TX	PA9
#define UART_02_RX	PA3
#define UART_02_TX	PA2

