dennisppaul/klangstrom-arduino/stm32/variants/KLST_CORE/variant_KLST_CORE.h
/* ENCODER */

#define ENCODER_00_A	    PH10
#define ENCODER_00_B	    PH11
#define ENCODER_00_BUTTON	PG8
#define ENCODER_01_A	    PE9
#define ENCODER_01_B	    PE11
#define ENCODER_01_BUTTON	PG6
#define ENCODER_02_A	    PA0
#define ENCODER_02_B	    PA1
#define ENCODER_02_BUTTON	PG7

/* SPI */

#define SPI_00_MISO	PF8
#define SPI_00_MOSI	PF9
#define SPI_00_SCK	PF7
#define SPI_01_MISO	PA6
#define SPI_01_MOSI	PD7
#define SPI_01_SCK	PG11
#define SPI_02_MISO	PG12
#define SPI_02_MOSI	PA7
#define SPI_02_SCK	PG13

/* I2C */

#define I2C_00_SCL	PF1
#define I2C_00_SDA	PF0
#define I2C_01_SCL	PB6
#define I2C_01_SDA	PB7
#define I2C_02_SCL	PD12
#define I2C_02_SDA	PF15

/* AUDIOCODEC */

#define AUDIOCODEC_I2C_SCL	PA8
#define AUDIOCODEC_I2C_SDA	PC9
#define AUDIOCODEC_I2S_CK	  PB10
#define AUDIOCODEC_I2S_MCK	PC6
#define AUDIOCODEC_I2S_SDI	PI2
#define AUDIOCODEC_I2S_SDO	PI3
#define AUDIOCODEC_I2S_WS	  PB12

/* RJ45 */

#define RJ45_SPI_MISO	      PC11
#define RJ45_SPI_MOSI	      PC12
#define RJ45_SPI_SCK	      PC10
#define RJ45_UART_RX	      PD9
#define RJ45_UART_TX	      PD8

/* SD CARD */

#define SDCARD_CS	          PE4
#define SDCARD_DETECT_SDIO	PE1
#define SDCARD_MISO     	  PE5
#define SDCARD_MOSI	        PE6
#define SDCARD_SCK	        PE2

/* USB */

#define USB_DEVICE_DM	      PA11
#define USB_DEVICE_DP	      PA12
#define USB_HOST_DM	        PB14
#define USB_HOST_DP	        PB15

/* --- PERIPHERALS ---------------------------------------------------------- */

/* USART */
// @todo(maybe add option to def out serial support)
#define ENABLE_HWSERIAL6
#define PIN_SERIAL6_RX      UART_00_RX
#define PIN_SERIAL6_TX      UART_00_TX
#define ENABLE_HWSERIAL1
#define PIN_SERIAL1_RX      UART_01_RX
#define PIN_SERIAL1_TX      UART_01_TX
#define ENABLE_HWSERIAL2
#define PIN_SERIAL2_RX      UART_02_RX
#define PIN_SERIAL2_TX      UART_02_TX

#define KLST_UART_BAUD      115200

/* ONBOARD + DEFAULT */

#define LED_BUILTIN         LED_00
#define USER_BTN            BUTTON_USER_00

/* SPI */
#ifndef PIN_SPI_SS
  #define PIN_SPI_SS        SDCARD_CS
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI      SDCARD_MOSI
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO      SDCARD_MISO
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK       SDCARD_SCK
#endif

/* I2C */
#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA      I2C_00_SDA
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL      I2C_00_SCL
#endif

/* TIMER */

#define ENCODER_00_TIMER    TIM5
#define ENCODER_01_TIMER    TIM1
#define ENCODER_02_TIMER    TIM2
#define KLST_BEAT_TIMER     TIM6
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM13
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

/* USART */
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  6
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         UART_00_RX
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         UART_00_TX
#endif

/* --------------- */
#ifdef __cplusplus
}
#endif
/* --------------- */

/* --------------- */
#ifdef __cplusplus
/* --------------- */

/* USART */
#define KLST_SERIAL_00          Serial6
#define KLST_SERIAL_01          Serial1
#define KLST_SERIAL_02          Serial2
#define SerialDebug             Serial
#define KLST_LOG                Serial

/* --------------- */
#endif
/* --------------- */

/* -------------------------------------------------------------------------- */

#endif /* _VARIANT_ARDUINO_STM32_ */
